# Date Time Manipulation

In [1]:
import numpy as np
import pandas as pd

In [2]:
date_range = pd.date_range('4/12/2021',periods=12,freq='M')
dates = pd.DataFrame(date_range,columns=['Date'])

In [3]:
dates

         Date
0  2021-04-30
1  2021-05-31
2  2021-06-30
3  2021-07-31
4  2021-08-31
5  2021-09-30
6  2021-10-31
7  2021-11-30
8  2021-12-31
9  2022-01-31
10 2022-02-28
11 2022-03-31

In [4]:
dates['Day'] = dates['Date'].dt.day
dates['Month'] = dates['Date'].dt.month
dates['Year'] = dates['Date'].dt.year


dates

         Date  Day  Month  Year
0  2021-04-30   30      4  2021
1  2021-05-31   31      5  2021
2  2021-06-30   30      6  2021
3  2021-07-31   31      7  2021
4  2021-08-31   31      8  2021
5  2021-09-30   30      9  2021
6  2021-10-31   31     10  2021
7  2021-11-30   30     11  2021
8  2021-12-31   31     12  2021
9  2022-01-31   31      1  2022
10 2022-02-28   28      2  2022
11 2022-03-31   31      3  2022

**Example to convert object data into proper data format**

In [5]:
df = pd.DataFrame({'DATE_TIME':['Jan 1 12:00 am','Jan 2 12:00 am']})
df

        DATE_TIME
0  Jan 1 12:00 am
1  Jan 2 12:00 am

In [6]:
df['Date'] = pd.to_datetime(df['DATE_TIME'], format ='%b %d %I:%M %p')
df

        DATE_TIME       Date
0  Jan 1 12:00 am 1900-01-01
1  Jan 2 12:00 am 1900-01-02

**For diffrent format please visit http://docs.python.org/3/library/datetime.html#strftime-and-strftime-behavior**

or search for "python datetime format documantation"

In [7]:
df['Day'] = df['Date'].dt.day
df['Month'] = df['Date'].dt.month
df['Year'] = df['Date'].dt.year


df

        DATE_TIME       Date  Day  Month  Year
0  Jan 1 12:00 am 1900-01-01    1      1  1900
1  Jan 2 12:00 am 1900-01-02    2      1  1900

**Delete the column which you do not want**